$.demo.data = {};
(function () {
    $.extend($.demo.data, {

        //固定空气质量监测点
        OHI: [
            { id: 51, name: "玄武湖监测点", num: "NJHB0032324321", address: "玄武巷1号(近洞庭路)", Lng: "118.798074", Lat: "32.075852" },
            { id: 52, name: "瑞金路监测点", num: "NJHB0032564372", address: "瑞金路84号", Lng: "118.812434", Lat: "32.031725" },
            { id: 53, name: "中华门监测点", num: "NJHB0032846352", address: "中华门126号", Lng: "118.775235", Lat: "32.002362" },
            { id: 54, name: "草场门监测点", num: "NJHB0032584156", address: "草场门大街66号", Lng: "118.754582", Lat: "32.05529" },
            { id: 55, name: "山西路监测点", num: "NJHB0032987546", address: "山西路55号", Lng: "118.774462", Lat: "32.070624" },
            { id: 56, name: "仙林大学城监测点", num: "NJHB0032756412", address: "栖霞区学海路", Lng: "118.91689", Lat: "32.113268" },
            { id: 57, name: "奥体中心监测点", num: "NJHB0032987589", address: "建邺区梦都大街50号", Lng: "118.741109", Lat: "32.00713" },
            { id: 58, name: "浦口监测点", num: "NJHB00323128751", address: "浦口区浦口大道", Lng: "118.643734", Lat: "32.073008" },
            { id: 68, name: "迈皋桥监测点", num: "NJHB0032311823", address: "栖霞区和燕路279号", Lng: "118.80807", Lat: "32.106597" },
            { id: 106, name: "江宁彩虹桥监测点", num: "NJHB0032758311", address: "江宁区天元中路123号", Lng: "118.83103301970846", Lat: "31.9280910197085" },
            { id: 30, name: "高淳淳溪监测点", num: "NJHB00328759122", address: "高淳区镇兴路229号", Lng: "118.890583", Lat: "31.3294" },
            { id: 43, name: "六合雄州监测点", num: "NJHB0032367473", address: "六合区北外街118号", Lng: "118.839798", Lat: "32.359663" },
            { id: 60, name: "溧水永阳监测点", num: "NJHB0032325543", address: "溧水区中山西路27号", Lng: "119.019125", Lat: "31.648064" },
            { id: 61, name: "中山南路监测点", num: "NJHB00328758975", address: "中山南路101号", Lng: "118.781299", Lat: "32.020971" },
            { id: 62, name: "松花江西街监测点", num: "NJHB0032300054", address: "松花江西街金陵中学实验小学大门", Lng: "118.731635", Lat: "32.013174" },
            { id: 63, name: "汉口西路监测点", num: "NJHB0032384632", address: "上海路汉口西路路口", Lng: "118.772043", Lat: "32.054894" },
            { id: 64, name: "汉中门大街监测点", num: "NJHB0032384432", address: "汉中门大街汉中门桥以西北侧", Lng: "118.764821", Lat: "32.041756" },
        ],

        air: [
            { id: 1, name: "龙园南路监测点", num: "AIR13328574", address: "江东北路龙园南路", Lng: "118.739579", Lat: "32.052065" },
            { id: 2, name: "北京西路监测点", num: "AIR13322475", address: "北京西路草场门桥以东南侧", Lng: "118.753168", Lat: "32.059238" },
            { id: 3, name: "软件大道监测点", num: "AIR13329007", address: "玉兰路软件大道", Lng: "118.792483", Lat: "31.980236" },
            { id: 4, name: "燕山路监测点", num: "AIR13323155", address: "梦都大街燕山路", Lng: "118.727329", Lat: "32.011878" },
            { id: 5, name: "长虹路监测点", num: "AIR13327283", address: "集庆门大街长虹路", Lng: "118.766126", Lat: "32.01941" },
            { id: 6, name: "珠江路监测点", num: "AIR13328574", address: "中山路珠江路", Lng: "118.784153", Lat: "32.050372" },
        ],

        //移动车辆监测点
        car: [{ id: 1001, name: "流动监测车A", num: "SQ001", range: "龙蟠路高架", address: "通济门隧道出口往龙蟠路高架", Lng: "118.801986", Lat: "32.029391" },
              { id: 1002, name: "流动监测车B", num: "SQ002", range: "应天高架", address: "应天高架", Lng: "118.764908", Lat: "32.013289" }],

        //汽车尾气监测点
        //car_Exhaust: [
        //    { id: 1, name: "南京中电熊猫液晶显示科技有限公司", num: "PD00202", address: "南京熊猫电子装备有限公司", Lng: "", Lat: "" },
        //    { id: 2, name: "中国石油化工股份有限公司金陵分公司", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 3, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 4, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 5, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 6, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 7, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 8, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 9, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //    { id: 10, name: "", num: "", address: "玄武巷1号(近洞庭路)", Lng: "", Lat: "" },
        //],

        //工业污染企业
        ndustrial_pollution: [
            { id: 1, name: "扬子石油化工工程公司", num: "NJHB0032324321", address: "大厂新华东路9号", Lng: "118.77587556838989", Lat: "32.239484678678615" },
            { id: 2, name: "帝斯曼东方化工公司", num: "NJHB0032564372", address: "南京市六合区葛关路701号", Lng: "118.75259399414062", Lat: "32.239176137480825" },
            { id: 3, name: "中国石化集团南京化学工业公司", num: "NJHB0032846352", address: "葛关路268", Lng: "118.76307606697082", Lat: "32.23007370074486" },
            { id: 4, name: "空气化工产品(南京)气体有限公司", num: "NJHB0032584156", address: "大厂园东路171号", Lng: "118.75746488571167", Lat: "32.22160571021734" },
            { id: 5, name: "南京留格化工有限公司", num: "NJHB0032987546", address: "沿江工业开发区杨庄南村28号", Lng: "118.73493432998658", Lat: "32.21127605367511" },
            { id: 6, name: "南京亚邦油脂化工厂", num: "NJHB0032756412", address: "凤凰南路1号2楼", Lng: "118.75129580497741", Lat: "32.20544808472318" },
            { id: 7, name: "江苏艾津农化有限责任公司", num: "NJHB0032987589", address: "双巷路58号", Lng: "118.85550498962401", Lat: "32.2754134834002" },
            { id: 8, name: "南京红太阳生物化学公司	", num: "NJHB00323128751", address: "南京市化学工业园芳烃南路168号", Lng: "118.8126754760742", Lat: "32.278279916745184" },
            { id: 9, name: "中国石化扬子石油化工公司烯烃厂", num: "NJHB0032311823", address: "南京市六合区", Lng: "118.79443645477296", Lat: "32.25400307939434" },
            { id: 10, name: "江苏钟山化工有限公司", num: "NJHB0032758311", address: "南京市六合区", Lng: "118.83516311645506", Lat: "32.26115253868096" },
            { id: 11, name: "中国烟草江苏中烟工业", num: "NJHB0032384632", address: "梦都路30号", Lng: "118.74465465545654", Lat: "32.00354515909284" },
            { id: 12, name: "南京市鼓楼区商业机械厂", num: "NJHB0032384432", address: "积余村49号", Lng: "118.73199462890626", Lat: "32.03252749583841" },
        ]

    })
})(jQuery);